zsh-utilities-functions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Zsh Utilities Functions</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="css/styles.css" />
               <link rel="stylesheet" href="css/org-pygments.css" />
               <link rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css" />
</head>
<body onload="randomLinkColor();displayTOC();"><div id="toc"></div>
<div id="preamble" class="status">
<a href="index.html"><i class="fa fa-home"></i></a><br/> <a href="https://github.com/xgarrido/zsh-utilities"><i class="fa fa-github"></i></a><br/>
</div>
<div id="content">
<h1 class="title">Zsh Utilities Functions</h1>
<p>
This is part of the <a href="zsh-utilities.html">Zsh Utilities</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Zsh Utilities - Functions</h2>
<div class="outline-text-2" id="text-1">
<p>
This file provides several functions for very different use. See the description
to understand the aim of each of them.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Package manager</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This part defines some function in relation with package management. It defines
generic function name given the linux system installed : "debian-like" system or
<a href="https://www.archlinux.org/">archlinux</a>.
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">Check linux system</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">__is_debian</span> ()
{
    <span class="org-keyword">if</span> pkgtools__has_binary apt-fast; <span class="org-keyword">then</span>
        <span class="org-variable-name">__pkg_mgr</span>=<span class="org-string">"apt-fast"</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">elif</span> pkgtools__has_binary apt-get; <span class="org-keyword">then</span>
        <span class="org-variable-name">__pkg_mgr</span>=<span class="org-string">"apt-get"</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">elif</span> pkgtools__has_binary yaourt; <span class="org-keyword">then</span>
        <span class="org-variable-name">__pkg_mgr</span>=<span class="org-string">"yaourt"</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">elif</span> pkgtools__has_binary pacman; <span class="org-keyword">then</span>
        <span class="org-variable-name">__pkg_mgr</span>=<span class="org-string">"pacman"</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">Implement generic function</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">alias</span> pkg-notify=<span class="org-string">'notify -t 2000 -i stock_dialog-info "${__pkg_mgr}"'</span>
<span class="org-keyword">if</span> __is_debian; <span class="org-keyword">then</span>

    <span class="org-keyword">function</span> <span class="org-function-name">install</span> ()
    {
        __pkgtools__at_function_enter install
        sudo ${<span class="org-variable-name">__pkg_mgr</span>} install -y $<span class="org-variable-name">*</span> &amp;&amp; pkg-notify <span class="org-string">"Installed $@"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 0
    }
    compdef <span class="org-string">"_deb_packages uninstalled"</span> install

    <span class="org-keyword">function</span> <span class="org-function-name">remove</span> ()
    {
        __pkgtools__at_function_enter remove
        sudo ${<span class="org-variable-name">__pkg_mgr</span>} remove -y $<span class="org-variable-name">*</span> &amp;&amp; pkg-notify <span class="org-string">"Removed $@"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 0
    }
    compdef <span class="org-string">"_deb_packages installed"</span> remove

    <span class="org-keyword">function</span> <span class="org-function-name">upgrade</span> ()
    {
        __pkgtools__at_function_enter upgrade
        sudo ${<span class="org-variable-name">__pkg_mgr</span>} update &amp;&amp; sudo ${<span class="org-variable-name">__pkg_mgr</span>} upgrade &amp;&amp; pkg-notify <span class="org-string">"Upgrade done"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 0
    }

    <span class="org-keyword">function</span> <span class="org-function-name">search</span> ()
    {
        __pkgtools__at_function_enter search
        apt-cache search $<span class="org-variable-name">@</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 0
    }

    <span class="org-keyword">function</span> <span class="org-function-name">purge</span> ()
    {
        __pkgtools__at_function_enter purge
        sudo ${<span class="org-variable-name">__pkg_mgr</span>} purge &amp;&amp; pkg-notify <span class="org-string">"Purge done"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 0
    }

    <span class="org-keyword">function</span> <span class="org-function-name">distupgrade</span> ()
    {
        __pkgtools__at_function_enter distupgrade
        sudo ${<span class="org-variable-name">__pkg_mgr</span>} update &amp;&amp; sudo ${<span class="org-variable-name">__pkg_mgr</span>} dist-upgrade &amp;&amp; pkg-notify <span class="org-string">"Distribution upgrade done"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 0
    }

    <span class="org-keyword">function</span> <span class="org-function-name">autoremove</span> ()
    {
        __pkgtools__at_function_enter autoremove
        sudo ${<span class="org-variable-name">__pkg_mgr</span>} autoremove &amp;&amp; pkg-notify <span class="org-string">"Autoremove done"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 0
    }
<span class="org-keyword">else</span>
    <span class="org-keyword">function</span> <span class="org-function-name">upgrade</span> ()
    {
        __pkgtools__at_function_enter upgrade
        ${<span class="org-variable-name">__pkg_mgr</span>} -Suy &amp;&amp; pkg-notify <span class="org-string">"Upgrade done"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 0
    }

    <span class="org-keyword">function</span> <span class="org-function-name">upgrade-devel</span> ()
    {
        __pkgtools__at_function_enter upgrade-devel
        ${<span class="org-variable-name">__pkg_mgr</span>} -Suya --devel &amp;&amp; pkg-notify <span class="org-string">"Upgrade done"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 0
    }

    <span class="org-keyword">function</span> <span class="org-function-name">search</span> ()
    {
        __pkgtools__at_function_enter search
        ${<span class="org-variable-name">__pkg_mgr</span>} -Ss $<span class="org-variable-name">@</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 0
    }

    <span class="org-keyword">function</span> <span class="org-function-name">purge</span> ()
    {
        __pkgtools__at_function_enter purge
        ${<span class="org-variable-name">__pkg_mgr</span>} -Qdt &amp;&amp; pkg-notify <span class="org-string">"Purge done"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 0
    }
<span class="org-keyword">fi</span>
</pre>
</div>
</div>
</div>
</div>
