zsh-utilities-functions.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Extract archive</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">extract</span> ()
{
    __pkgtools__at_function_enter extract
    <span class="org-builtin">local</span> remove_archive
    <span class="org-builtin">local</span> success
    <span class="org-builtin">local</span> file_name
    <span class="org-builtin">local</span> extract_dir

    <span class="org-keyword">if</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">""</span> ]]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"Usage: extract [-option] [file ...]"</span>
        <span class="org-builtin">echo</span>
        <span class="org-builtin">echo</span> <span class="org-string">"Options:"</span>
        <span class="org-builtin">echo</span> <span class="org-string">"    -r, --remove : Remove archive."</span>
        <span class="org-builtin">echo</span>
    <span class="org-keyword">fi</span>

    <span class="org-variable-name">remove_archive</span>=1
    <span class="org-keyword">if</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">"-r"</span> ]] || [[ <span class="org-string">"$1"</span> == <span class="org-string">"--remove"</span> ]]; <span class="org-keyword">then</span>
        <span class="org-variable-name">remove_archive</span>=0
        <span class="org-builtin">shift</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">while</span> [ -n <span class="org-string">"$1"</span> ]; <span class="org-keyword">do</span>
        <span class="org-keyword">if</span> [[ <span class="org-negation-char">!</span> -f <span class="org-string">"$1"</span> ]]; <span class="org-keyword">then</span>
            pkgtools__msg_warning <span class="org-string">"'$1' is not a valid file"</span>
            <span class="org-builtin">shift</span>
            <span class="org-keyword">continue</span>
        <span class="org-keyword">fi</span>

        <span class="org-variable-name">success</span>=0
        <span class="org-variable-name">file_name</span>=<span class="org-string">"$( basename "$1" )"</span>
        <span class="org-variable-name">extract_dir</span>=<span class="org-string">"$( echo "$file_name" | sed "s/\.${1##*.}//g" )"</span>
        <span class="org-keyword">case</span> <span class="org-string">"$1"</span><span class="org-keyword"> in</span>
            (*.tar.gz|*.tgz) tar xvzf <span class="org-string">"$1"</span> ;;
            (*.tar.bz2|*.tbz|*.tbz2) tar xvjf <span class="org-string">"$1"</span> ;;
            (*.tar.xz|*.txz) tar --xz --help &amp;&gt; /dev/null <span class="org-sh-escaped-newline">\</span>
                &amp;&amp; tar --xz -xvf <span class="org-string">"$1"</span> <span class="org-sh-escaped-newline">\</span>
                || xzcat <span class="org-string">"$1"</span> | tar xvf - ;;
            (*.tar.zma|*.tlz) tar --lzma --help &amp;&gt; /dev/null <span class="org-sh-escaped-newline">\</span>
                &amp;&amp; tar --lzma -xvf <span class="org-string">"$1"</span> <span class="org-sh-escaped-newline">\</span>
                || lzcat <span class="org-string">"$1"</span> | tar xvf - ;;
            (*.tar) tar xvf <span class="org-string">"$1"</span> ;;
            (*.gz) gunzip <span class="org-string">"$1"</span> ;;
            (*.bz2) bunzip2 <span class="org-string">"$1"</span> ;;
            (*.xz) unxz <span class="org-string">"$1"</span> ;;
            (*.lzma) unlzma <span class="org-string">"$1"</span> ;;
            (*.Z) uncompress <span class="org-string">"$1"</span> ;;
            (*.zip) unzip <span class="org-string">"$1"</span> -d $<span class="org-variable-name">extract_dir</span> ;;
            (*.rar) unrar e -ad <span class="org-string">"$1"</span> ;;
            (*.7z) 7za x <span class="org-string">"$1"</span> ;;
            (*.deb)
                mkdir -p <span class="org-string">"$extract_dir/control"</span>
                mkdir -p <span class="org-string">"$extract_dir/data"</span>
                <span class="org-builtin">cd</span> <span class="org-string">"$extract_dir"</span>; ar vx <span class="org-string">"../${1}"</span> &gt; /dev/null
                <span class="org-builtin">cd</span> control; tar xzvf ../control.tar.gz
                <span class="org-builtin">cd</span> ../data; tar xzvf ../data.tar.gz
                <span class="org-builtin">cd</span> ..; rm *.tar.gz debian-binary
                <span class="org-builtin">cd</span> ..
                ;;
            (*)
                pkgtools__msg_error <span class="org-string">"'$1' cannot be extracted"</span> 1&gt;&amp;2
                <span class="org-variable-name">success</span>=1
                ;;
        <span class="org-keyword">esac</span>

        (( <span class="org-variable-name">success</span> = $<span class="org-variable-name">success</span> &gt; 0 ? $<span class="org-variable-name">success</span> : $<span class="org-variable-name">?</span> ))
        (( $<span class="org-variable-name">success</span> == 0 )) &amp;&amp; (( $<span class="org-variable-name">remove_archive</span> == 0 )) &amp;&amp; rm <span class="org-string">"$1"</span>
        <span class="org-builtin">shift</span>
    <span class="org-keyword">done</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Notification</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Base function for notification
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">notify</span> ()
{
    <span class="org-keyword">if</span> pkgtools__has_binary notify-send; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> [ <span class="org-string">"$HOSTNAME"</span> = <span class="org-string">"garrido-laptop"</span> ]; <span class="org-keyword">then</span>
            notify-send $<span class="org-variable-name">@</span> &gt; /dev/null 2&gt;&amp;1
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">Success</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">notify_success</span> ()
{
    __pkgtools__at_function_enter notify_success
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -ne 0 ]; <span class="org-keyword">then</span>
        notify -t 2000 -i stock_dialog-info <span class="org-string">"Notice"</span> <span class="org-string">"${PREEXEC_CMD:-Shell Command}"</span>
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">Error</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">notify_error</span> ()
{
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -ne 0 ]; <span class="org-keyword">then</span>
        notify -t 2000 -i stock_dialog-error <span class="org-string">" "</span> <span class="org-string">"${PREEXEC_CMD:-Shell Command} $@"</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">Warning</h4>
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">notify_warning</span> ()
{
    notify -t 3000 -i stock_dialog-warning <span class="org-string">" "</span> <span class="org-string">"${PREEXEC_CMD:-Shell Command} $@"</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>
