zsh-utilities-functions.org
** Zsh =precmd= and =preexec=
These two functions are only available for =zsh= shell. There are run at every
shell command and trigger notification events in case of long time command or
failling ones. This is pretty useful when long command such as compilation
command are running : user can go to another desktop do whatever he wants but
get warned when the command has finished or has failed.
#+BEGIN_SRC sh
  function precmd ()
  {
      # must be first
      notify_error

      # BEGIN notify long running cmds
      stop=$(date +'%s')
      start=${PREEXEC_TIME:-$stop}
      let elapsed=$stop-$start
      max=${PREEXEC_MAX:-10}

      for i in ${PREEXEC_EXCLUDE_LIST:-}; do
          if [ "x$i" = "x$PREEXEC_CMD" ]; then
              max=999999;
              break;
          fi
      done

      if [ $elapsed -gt $max ]; then
          notify_warning "finished ($elapsed secs)"
      fi
      # END notify long running cmds

      # Update scheme color
      if (( $+functions[__load_scheme] )); then
          __load_scheme
      fi

      return 0
  }

  function preexec ()
  {
      if [[ "$TERM" == "screen" ]]; then
          local CMD=${1}
          echo -ne "\ek$CMD\e\\"
      fi
      # for notifying of long running commands
      export PREEXEC_CMD=`echo $1 | awk '{ print $1; }'`
      export PREEXEC_TIME=$(date +'%s')
      return 0
  }
#+END_SRC

