zsh-utilities-functions.html

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Zsh <code>precmd</code> and <code>preexec</code></h3>
<div class="outline-text-3" id="text-1-4">
<p>
These two functions are only available for <code>zsh</code> shell. There are run at every
shell command and trigger notification events in case of long time command or
failling ones. This is pretty useful when long command such as compilation
command are running : user can go to another desktop do whatever he wants but
get warned when the command has finished or has failed.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">precmd</span> ()
{
    <span class="org-comment-delimiter"># </span><span class="org-comment">must be first</span>
    notify_error

    <span class="org-comment-delimiter"># </span><span class="org-comment">BEGIN notify long running cmds</span>
    <span class="org-variable-name">stop</span>=$(date +<span class="org-string">'%s'</span>)
    <span class="org-variable-name">start</span>=${<span class="org-variable-name">PREEXEC_TIME</span>:-$<span class="org-variable-name">stop</span>}
    <span class="org-builtin">let</span> <span class="org-variable-name">elapsed</span>=$<span class="org-variable-name">stop</span>-$<span class="org-variable-name">start</span>
    <span class="org-variable-name">max</span>=${<span class="org-variable-name">PREEXEC_MAX</span>:-10}

    <span class="org-keyword">for</span> i<span class="org-keyword"> in</span> ${<span class="org-variable-name">PREEXEC_EXCLUDE_LIST</span>:-}; <span class="org-keyword">do</span>
        <span class="org-keyword">if</span> [ <span class="org-string">"x$i"</span> = <span class="org-string">"x$PREEXEC_CMD"</span> ]; <span class="org-keyword">then</span>
            <span class="org-variable-name">max</span>=999999;
            <span class="org-keyword">break</span>;
        <span class="org-keyword">fi</span>
    <span class="org-keyword">done</span>

    <span class="org-keyword">if</span> [ $<span class="org-variable-name">elapsed</span> -gt $<span class="org-variable-name">max</span> ]; <span class="org-keyword">then</span>
        notify_warning <span class="org-string">"finished ($elapsed secs)"</span>
    <span class="org-keyword">fi</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">END notify long running cmds</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Update scheme color</span>
    <span class="org-keyword">if</span> (( $+functions[__load_scheme] )); <span class="org-keyword">then</span>
        __load_scheme
    <span class="org-keyword">fi</span>

    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">preexec</span> ()
{
    <span class="org-keyword">if</span> [[ <span class="org-string">"$TERM"</span> == <span class="org-string">"screen"</span> ]]; <span class="org-keyword">then</span>
        <span class="org-builtin">local</span> <span class="org-variable-name">CMD</span>=${<span class="org-variable-name">1</span>}
        <span class="org-builtin">echo</span> -ne <span class="org-string">"\ek$CMD\e\\"</span>
    <span class="org-keyword">fi</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">for notifying of long running commands</span>
    <span class="org-builtin">export</span> <span class="org-variable-name">PREEXEC_CMD</span>=<span class="org-sh-quoted-exec">`echo $1 | awk '{ print $1; }'`</span>
    <span class="org-builtin">export</span> <span class="org-variable-name">PREEXEC_TIME</span>=$(date +<span class="org-string">'%s'</span>)
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
