zsh-utilities-functions.html

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">SSH connection</h3>
<div class="outline-text-3" id="text-1-5">
<p>
This should be improved by doing something as wakeonlan did with a small machine
db.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">connect</span> ()
{
    __pkgtools__at_function_enter connect
    <span class="org-builtin">local</span> <span class="org-variable-name">use_screen</span>=0
    <span class="org-builtin">local</span> <span class="org-variable-name">server_name</span>=
    <span class="org-builtin">local</span> <span class="org-variable-name">ssh_option</span>=
    <span class="org-builtin">local</span> <span class="org-variable-name">append_command</span>=

    <span class="org-keyword">if</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">""</span> ]]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"Missing the name of machine to connect !"</span>
        <span class="org-builtin">echo</span> <span class="org-string">""</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>

    <span class="org-keyword">while</span> [ -n <span class="org-string">"$1"</span> ]; <span class="org-keyword">do</span>
        <span class="org-keyword">if</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">"-s"</span> ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">use_screen</span>=1
        <span class="org-keyword">elif</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">"fzk"</span> ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">ssh_option</span>=<span class="org-string">"-p 24"</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"augerlogin.fzk.de"</span>
        <span class="org-keyword">elif</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">"cern"</span> ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"xgarrido@lxplus.cern.ch"</span>
        <span class="org-keyword">elif</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">"lyon"</span> ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"garrido@ccage.in2p3.fr"</span>
        <span class="org-keyword">elif</span> [[ $<span class="org-variable-name">1</span> == ccige* ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"garrido@$1.in2p3.fr"</span>
        <span class="org-keyword">elif</span> [[ $<span class="org-variable-name">1</span> == ccage* ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"garrido@$1.in2p3.fr"</span>
        <span class="org-keyword">elif</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">"ovh"</span> ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">ssh_option</span>=<span class="org-string">"-p 1234"</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"garrido@r17187.ovh.net"</span>
        <span class="org-keyword">elif</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">"laptop"</span> ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"garrido@nb-nemo6.lal.in2p3.fr"</span>
        <span class="org-keyword">elif</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">"mac"</span> ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">ssh_option</span>=<span class="org-string">"-p 24"</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"garrido@xgarrido.dyndns.org"</span>
        <span class="org-keyword">elif</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">"syno"</span> ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"xgarrido@xgarrido.ydns.eu"</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">elif [[ "$1" == "debian" ]]; then</span>
        <span class="org-comment-delimiter">#     </span><span class="org-comment">server_name="debian@xgarrido.dyndns.org"</span>
        <span class="org-keyword">elif</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">"lx3"</span> ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"garrido@lx3.lal.in2p3.fr"</span>
        <span class="org-keyword">elif</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">"daq-nemo"</span> ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"bipolal@pc-nemo12.lal.in2p3.fr"</span>
        <span class="org-keyword">elif</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">"daq-lsm"</span> ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"nemoacq@lsmlx5.in2p3.fr"</span>
        <span class="org-keyword">elif</span> [[ $<span class="org-variable-name">1</span> == pc-nemo* ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"nemo@$1"</span>
        <span class="org-keyword">elif</span> [[ $<span class="org-variable-name">1</span> == pc-91089 ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"garrido@$1"</span>
        <span class="org-keyword">elif</span> [[ $<span class="org-variable-name">1</span> == nemo* ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">server_name</span>=<span class="org-string">"garrido@$1.lal.in2p3.fr"</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">else</span>
        <span class="org-comment-delimiter">#     </span><span class="org-comment">if [ "${HOSTNAME}" = "garrido-laptop" ]; then</span>
        <span class="org-comment-delimiter">#         </span><span class="org-comment">server_name="garrido@localhost"</span>
        <span class="org-comment-delimiter">#         </span><span class="org-comment">if [ -f /tmp/npu.d/ports ]; then</span>
        <span class="org-comment-delimiter">#             </span><span class="org-comment">ssh_port=$(cat /tmp/npu.d/ports | grep $1 | cut -d' ' -f2)</span>
        <span class="org-comment-delimiter">#             </span><span class="org-comment">ssh_option="-p ${ssh_port}"</span>
        <span class="org-comment-delimiter">#         </span><span class="org-comment">else</span>
        <span class="org-comment-delimiter">#             </span><span class="org-comment">append_command+="$1 "</span>
        <span class="org-comment-delimiter">#         </span><span class="org-comment">fi</span>
        <span class="org-comment-delimiter">#     </span><span class="org-comment">else</span>
        <span class="org-comment-delimiter">#         </span><span class="org-comment">if [[ "$1" == "pc" ]]; then</span>
        <span class="org-comment-delimiter">#             </span><span class="org-comment">server_name="pc-91089.lal.in2p3.fr"</span>
        <span class="org-comment-delimiter">#         </span><span class="org-comment">else</span>
        <span class="org-comment-delimiter">#             </span><span class="org-comment">server_name="$1.lal.in2p3.fr"</span>
        <span class="org-comment-delimiter">#         </span><span class="org-comment">fi</span>
        <span class="org-comment-delimiter">#     </span><span class="org-comment">fi</span>
        <span class="org-keyword">fi</span>
        <span class="org-builtin">shift</span> 1
    <span class="org-keyword">done</span>

    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">use_screen</span>} -eq 0 ]; <span class="org-keyword">then</span>
        pkgtools__msg_notice <span class="org-string">"Connecting to ${server_name}..."</span>
        ssh -Y ${<span class="org-variable-name">ssh_option</span>} ${<span class="org-variable-name">server_name</span>} <span class="org-string">"${append_command}"</span>
    <span class="org-keyword">else</span>
        pkgtools__msg_notice <span class="org-string">"Connecting to ${server_name} with screen support..."</span>
        screen ssh -Y ${<span class="org-variable-name">ssh_option</span>} ${<span class="org-variable-name">server_name</span>}
    <span class="org-keyword">fi</span>

    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
<span class="org-comment-delimiter"># </span><span class="org-comment">Connect completion system</span>
compdef _connect connect

<span class="org-keyword">function</span> <span class="org-function-name">_connect</span> ()
{
    <span class="org-builtin">local</span> -a _machines
    <span class="org-variable-name">_machines</span>=(
        ccage:<span class="org-string">'CC Lyon job machines'</span>
        ccige:<span class="org-string">'CC Lyon interactive machines'</span>
        laptop:<span class="org-string">'Laptop machine'</span>
        mac:<span class="org-string">'iMac machine'</span>
        syno:<span class="org-string">'Synology server @ home'</span>
        lx3:<span class="org-string">'lxplus machine @ LAL'</span>
        nemo3:<span class="org-string">'nemo3 machine @ LAL'</span>
        nemo4:<span class="org-string">'nemo4 machine @ LAL'</span>
        pc-91089:<span class="org-string">'PC server machine @ LAL'</span>
        pc-nemo4:<span class="org-string">'V. Treytak machine'</span>
        pc-nemo5:<span class="org-string">'H. Gomez machine'</span>
        pc-nemo6:<span class="org-string">'Student machine'</span>
        pc-nemo8:<span class="org-string">'G. Eurin machine'</span>
    )
    _describe -t _machines <span class="org-string">'SSH machines'</span> _machines &amp;&amp; <span class="org-variable-name">ret</span>=0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Grepping information</h3>
