zsh-utilities-functions.org
*** Find a running job
#+BEGIN_SRC sh
  function psgrep ()
  {
      __pkgtools__at_function_enter psgrep
      if [[ ! -z $1 ]] ; then
          pkgtools__msg_notice "Grepping for processes matching $1..."
          ps aux | grep $1 | grep -v grep
      else
          pkgtools__msg_error "Need name to grep for !"
          __pkgtools__at_function_exit
          return 1
      fi
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC

*** Find a command within history
#+BEGIN_SRC sh
  function hgrep ()
  {
      __pkgtools__at_function_enter hgrep
      if [[ ! -z $1 ]] ; then
          pkgtools__msg_notice "Grepping for command matching $1..."
          history | grep $1
      else
          pkgtools__msg_error "Need name to grep for !"
          __pkgtools__at_function_exit
          return 1
      fi
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC

** Text edition
*** Remove all trailing whitespace in a given file
#+BEGIN_SRC sh
  function remove_trailing_whitespace ()
  {
      __pkgtools__at_function_enter remove_trailing_whitespace
      if [[ ! -z $1 ]] ; then
          pkgtools__msg_notice "Removing trailing whitespace in file $1..."
          find $1 -type f -exec sed -i 's/ *$//' '{}' ';'
      else
          pkgtools__msg_error "Missing filename !"
          __pkgtools__at_function_exit
          return 1
      fi
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
*** Remove duplicate lines
#+BEGIN_SRC sh
  function remove_duplicate_lines ()
  {
      __pkgtools__at_function_enter remove_duplicate_lines
      if [[ ! -z $1 ]] ; then
          pkgtools__msg_notice "Removing duplicate lines in file $1..."
          awk '!seen[$0]++' $1 > /tmp/$(basename $1).tmp
          mv /tmp/$(basename $1).tmp $1
      else
          pkgtools__msg_error "Missing filename !"
          __pkgtools__at_function_exit
          return 1
      fi
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
** Image edition
