zsh-utilities-functions.html
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1">Find a running job</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">psgrep</span> ()
{
    __pkgtools__at_function_enter psgrep
    <span class="org-keyword">if</span> [[ <span class="org-negation-char">!</span> -z $<span class="org-variable-name">1</span> ]] ; <span class="org-keyword">then</span>
        pkgtools__msg_notice <span class="org-string">"Grepping for processes matching $1..."</span>
        ps aux | grep $<span class="org-variable-name">1</span> | grep -v grep
    <span class="org-keyword">else</span>
        pkgtools__msg_error <span class="org-string">"Need name to grep for !"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2">Find a command within history</h4>
<div class="outline-text-4" id="text-1-6-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">hgrep</span> ()
{
    __pkgtools__at_function_enter hgrep
    <span class="org-keyword">if</span> [[ <span class="org-negation-char">!</span> -z $<span class="org-variable-name">1</span> ]] ; <span class="org-keyword">then</span>
        pkgtools__msg_notice <span class="org-string">"Grepping for command matching $1..."</span>
        <span class="org-builtin">history</span> | grep $<span class="org-variable-name">1</span>
    <span class="org-keyword">else</span>
        pkgtools__msg_error <span class="org-string">"Need name to grep for !"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Text edition</h3>
<div class="outline-text-3" id="text-1-7">
</div><div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1">Remove all trailing whitespace in a given file</h4>
<div class="outline-text-4" id="text-1-7-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">remove_trailing_whitespace</span> ()
{
    __pkgtools__at_function_enter remove_trailing_whitespace
    <span class="org-keyword">if</span> [[ <span class="org-negation-char">!</span> -z $<span class="org-variable-name">1</span> ]] ; <span class="org-keyword">then</span>
        pkgtools__msg_notice <span class="org-string">"Removing trailing whitespace in file $1..."</span>
        find $<span class="org-variable-name">1</span> -type f -exec sed -i <span class="org-string">'s/ *$//'</span> <span class="org-string">'{}'</span> <span class="org-string">';'</span>
    <span class="org-keyword">else</span>
        pkgtools__msg_error <span class="org-string">"Missing filename !"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-7-2" class="outline-4">
<h4 id="sec-1-7-2">Remove duplicate lines</h4>
<div class="outline-text-4" id="text-1-7-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">remove_duplicate_lines</span> ()
{
    __pkgtools__at_function_enter remove_duplicate_lines
    <span class="org-keyword">if</span> [[ <span class="org-negation-char">!</span> -z $<span class="org-variable-name">1</span> ]] ; <span class="org-keyword">then</span>
        pkgtools__msg_notice <span class="org-string">"Removing duplicate lines in file $1..."</span>
        awk <span class="org-string">'!seen[$0]++'</span> $<span class="org-variable-name">1</span> &gt; /tmp/$(basename $<span class="org-variable-name">1</span>).tmp
        mv /tmp/$(basename $<span class="org-variable-name">1</span>).tmp $<span class="org-variable-name">1</span>
    <span class="org-keyword">else</span>
        pkgtools__msg_error <span class="org-string">"Missing filename !"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>
