zsh-utilities-functions.org
*** Convert an EPS figure into tikz
#+BEGIN_SRC sh
  function eps2tikz ()
  {
      __pkgtools__at_function_enter eps2tikz
      local use_helvetica=0
      local keep_xfig=0
      local eps_file=
      local parse_switch=1

      if [[ "$1" == "" ]]; then
          echo "Usage: eps2tikz [-option] [eps files ...]"
          echo
          echo "Options:"
          echo "    -k, --keep-xfig : Keep the intermediate xfig file."
          echo
      fi

      while [ -n "$1" ]; do
          token="$1"
          if [[ "${token[1]}" = "-" ]]; then
              opt=${token}
              if [[ ${parse_switch} -eq 0 ]]; then
                  break
              fi
              if [ "${opt}" = "--keep-xfig" ]; then
                  keep_xfig=1
              else
                  pkgtools__msg_warning "Ignoring option '${opt}' !"
              fi
          else
              arg=${token}
              parse_switch=0
              if [ "${arg##*.}" = "eps" ]; then
                  eps_file="${eps_file} ${arg}"
              else
                  pkgtools_msg_warning "'${eps_file}' is not an Encapsulated PostScript"
              fi
          fi
          shift
      done

      if [[ -z "${eps_file}" ]]; then
          pkgtools__msg_error "Missing EPS file !"
          __pkgtools__at_function_exit
          return 1
      fi

      for i in $(echo ${eps_file}); do
          if [ ! -f "${i}" ]; then
              pkgtools__msg_warning "File ${i} does not exist! Skip it"
              continue
          fi

          local fig_file=${i/.eps/.fig}
          local tikz_file=${i/.eps/.tikz}

          pkgtools__msg_notice "Converting ${i} file to ${tikz_file}..."

          if [[ ! -x $(which pstoedit) ]]; then
              pkgtools__msg_error "Missing 'pstoedit' binary !"
              __pkgtools__at_function_exit
              return 1
          fi
          pstoedit -f xfig "${i}" > ${fig_file} 2> /dev/null

          if [[ ! -x $(which fig2tikz) ]]; then
              pkgtools__msg_error "Missing fig2tikz' binary !"
              __pkgtools__at_function_exit
              return 1
          fi
          fig2tikz ${fig_file} > ${tikz_file}.tmp
          pkgtools__msg_notice "Remove duplicate lines..."
          awk '!seen[$0]++' ${tikz_file}.tmp > ${tikz_file}
          rm -f ${tikz_file}.tmp

          if [[ ${keep_xfig} -eq 0 ]]; then
              rm -f ${fig_file}
          fi

      done
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC

*** Grab point with =dexter=
[[http://sourceforge.net/projects/dexter/][Dexter]] is a little java program to interactively or semi-automatically extract
data from scanned graphs. In its applet incarnation it is used by the
Astrophysics Data System.

#+BEGIN_SRC sh
  function dexter ()
  {
      __pkgtools__at_function_enter dexter
      if [[ "$1" == "" ]]; then
          echo "Usage: dexter [image files ...]"
          echo
          __pkgtools__at_function_exit
          return 1
      else
          java -jar /home/garrido/Workdir/Development/java/dexter/Debuxter.jar $1
      fi
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC

** Mounting/unmounting USB drives
#+BEGIN_SRC sh
  function usb_umount ()
  {
      for d in /media/*; do
          sudo umount $d
      done
      sudo modprobe usb_storage
  }
#+END_SRC
** Subversion functions
*** Better SVN status
#+BEGIN_SRC sh
  function svnstatus ()
  {
      __pkgtools__at_function_enter svnstatus
      templist=$(svn status $*)
      echo "$(echo $templist | grep '^?' | wc -l) unversioned files/directories"
      echo $templist | grep -v '^?'
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
*** Better SVN diff (needs code2color)
#+BEGIN_SRC sh
  function svndiff ()
  {
      __pkgtools__at_function_enter svndiff
      svn diff $* | code2color -l patch -
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
** Misc.
