zsh-utilities-functions.html
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">Image edition</h3>
<div class="outline-text-3" id="text-1-8">
</div><div id="outline-container-sec-1-8-1" class="outline-4">
<h4 id="sec-1-8-1">Convert an EPS figure into tikz</h4>
<div class="outline-text-4" id="text-1-8-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">eps2tikz</span> ()
{
    __pkgtools__at_function_enter eps2tikz
    <span class="org-builtin">local</span> <span class="org-variable-name">use_helvetica</span>=0
    <span class="org-builtin">local</span> <span class="org-variable-name">keep_xfig</span>=0
    <span class="org-builtin">local</span> <span class="org-variable-name">eps_file</span>=
    <span class="org-builtin">local</span> <span class="org-variable-name">parse_switch</span>=1

    <span class="org-keyword">if</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">""</span> ]]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"Usage: eps2tikz [-option] [eps files ...]"</span>
        <span class="org-builtin">echo</span>
        <span class="org-builtin">echo</span> <span class="org-string">"Options:"</span>
        <span class="org-builtin">echo</span> <span class="org-string">"    -k, --keep-xfig : Keep the intermediate xfig file."</span>
        <span class="org-builtin">echo</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">while</span> [ -n <span class="org-string">"$1"</span> ]; <span class="org-keyword">do</span>
        <span class="org-variable-name">token</span>=<span class="org-string">"$1"</span>
        <span class="org-keyword">if</span> [[ <span class="org-string">"${token[1]}"</span> = <span class="org-string">"-"</span> ]]; <span class="org-keyword">then</span>
            <span class="org-variable-name">opt</span>=${<span class="org-variable-name">token</span>}
            <span class="org-keyword">if</span> [[ ${<span class="org-variable-name">parse_switch</span>} -eq 0 ]]; <span class="org-keyword">then</span>
                <span class="org-keyword">break</span>
            <span class="org-keyword">fi</span>
            <span class="org-keyword">if</span> [ <span class="org-string">"${opt}"</span> = <span class="org-string">"--keep-xfig"</span> ]; <span class="org-keyword">then</span>
                <span class="org-variable-name">keep_xfig</span>=1
            <span class="org-keyword">else</span>
                pkgtools__msg_warning <span class="org-string">"Ignoring option '${opt}' !"</span>
            <span class="org-keyword">fi</span>
        <span class="org-keyword">else</span>
            <span class="org-variable-name">arg</span>=${<span class="org-variable-name">token</span>}
            <span class="org-variable-name">parse_switch</span>=0
            <span class="org-keyword">if</span> [ <span class="org-string">"${arg##*.}"</span> = <span class="org-string">"eps"</span> ]; <span class="org-keyword">then</span>
                <span class="org-variable-name">eps_file</span>=<span class="org-string">"${eps_file} ${arg}"</span>
            <span class="org-keyword">else</span>
                pkgtools_msg_warning <span class="org-string">"'${eps_file}' is not an Encapsulated PostScript"</span>
            <span class="org-keyword">fi</span>
        <span class="org-keyword">fi</span>
        <span class="org-builtin">shift</span>
    <span class="org-keyword">done</span>

    <span class="org-keyword">if</span> [[ -z <span class="org-string">"${eps_file}"</span> ]]; <span class="org-keyword">then</span>
        pkgtools__msg_error <span class="org-string">"Missing EPS file !"</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>

    <span class="org-keyword">for</span> i<span class="org-keyword"> in</span> $(<span class="org-builtin">echo</span> ${<span class="org-variable-name">eps_file</span>}); <span class="org-keyword">do</span>
        <span class="org-keyword">if</span> [ <span class="org-negation-char">!</span> -f <span class="org-string">"${i}"</span> ]; <span class="org-keyword">then</span>
            pkgtools__msg_warning <span class="org-string">"File ${i} does not exist! Skip it"</span>
            <span class="org-keyword">continue</span>
        <span class="org-keyword">fi</span>

        <span class="org-builtin">local</span> <span class="org-variable-name">fig_file</span>=${<span class="org-variable-name">i</span>/.eps/.fig}
        <span class="org-builtin">local</span> <span class="org-variable-name">tikz_file</span>=${<span class="org-variable-name">i</span>/.eps/.tikz}

        pkgtools__msg_notice <span class="org-string">"Converting ${i} file to ${tikz_file}..."</span>

        <span class="org-keyword">if</span> [[ <span class="org-negation-char">!</span> -x $(<span class="org-builtin">which</span> pstoedit) ]]; <span class="org-keyword">then</span>
            pkgtools__msg_error <span class="org-string">"Missing 'pstoedit' binary !"</span>
            __pkgtools__at_function_exit
            <span class="org-keyword">return</span> 1
        <span class="org-keyword">fi</span>
        pstoedit -f xfig <span class="org-string">"${i}"</span> &gt; ${<span class="org-variable-name">fig_file</span>} 2&gt; /dev/null

        <span class="org-keyword">if</span> [[ <span class="org-negation-char">!</span> -x $(<span class="org-builtin">which</span> fig2tikz) ]]; <span class="org-keyword">then</span>
            pkgtools__msg_error <span class="org-string">"Missing fig2tikz' binary !"</span>
            __pkgtools__at_function_exit
            <span class="org-keyword">return</span> 1
        <span class="org-keyword">fi</span>
        fig2tikz ${<span class="org-variable-name">fig_file</span>} &gt; ${<span class="org-variable-name">tikz_file</span>}.tmp
        pkgtools__msg_notice <span class="org-string">"Remove duplicate lines..."</span>
        awk <span class="org-string">'!seen[$0]++'</span> ${<span class="org-variable-name">tikz_file</span>}.tmp &gt; ${<span class="org-variable-name">tikz_file</span>}
        rm -f ${<span class="org-variable-name">tikz_file</span>}.tmp

        <span class="org-keyword">if</span> [[ ${<span class="org-variable-name">keep_xfig</span>} -eq 0 ]]; <span class="org-keyword">then</span>
            rm -f ${<span class="org-variable-name">fig_file</span>}
        <span class="org-keyword">fi</span>

    <span class="org-keyword">done</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-8-2" class="outline-4">
<h4 id="sec-1-8-2">Grab point with <code>dexter</code></h4>
<div class="outline-text-4" id="text-1-8-2">
<p>
<a href="http://sourceforge.net/projects/dexter/">Dexter</a> is a little java program to interactively or semi-automatically extract
data from scanned graphs. In its applet incarnation it is used by the
Astrophysics Data System.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">dexter</span> ()
{
    __pkgtools__at_function_enter dexter
    <span class="org-keyword">if</span> [[ <span class="org-string">"$1"</span> == <span class="org-string">""</span> ]]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> <span class="org-string">"Usage: dexter [image files ...]"</span>
        <span class="org-builtin">echo</span>
        __pkgtools__at_function_exit
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">else</span>
        java -jar /home/garrido/Workdir/Development/java/dexter/Debuxter.jar $<span class="org-variable-name">1</span>
    <span class="org-keyword">fi</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">Mounting/unmounting USB drives</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">usb_umount</span> ()
{
    <span class="org-keyword">for</span> d<span class="org-keyword"> in</span> /media/*; <span class="org-keyword">do</span>
        sudo umount $<span class="org-variable-name">d</span>
    <span class="org-keyword">done</span>
    sudo modprobe usb_storage
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10">Subversion functions</h3>
<div class="outline-text-3" id="text-1-10">
</div><div id="outline-container-sec-1-10-1" class="outline-4">
<h4 id="sec-1-10-1">Better SVN status</h4>
<div class="outline-text-4" id="text-1-10-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">svnstatus</span> ()
{
    __pkgtools__at_function_enter svnstatus
    <span class="org-variable-name">templist</span>=$(svn status $<span class="org-variable-name">*</span>)
    <span class="org-builtin">echo</span> <span class="org-string">"$(echo $templist | grep '^?' | wc -l) unversioned files/directories"</span>
    <span class="org-builtin">echo</span> $<span class="org-variable-name">templist</span> | grep -v <span class="org-string">'^?'</span>
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-10-2" class="outline-4">
<h4 id="sec-1-10-2">Better SVN diff (needs code2color)</h4>
<div class="outline-text-4" id="text-1-10-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">svndiff</span> ()
{
    __pkgtools__at_function_enter svndiff
    svn diff $<span class="org-variable-name">*</span> | code2color -l patch -
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>
